Public Attributes | List of all members
API_AnalyticalPointLoadType Struct Reference
Analytical Model
Describes a Structural Analytical Model Member Point Load. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_AnalyticalPointLoad_Settings  | analyticalPointLoadSettings
API_AnalyticalMemberPartRef  | loadedMemberPartRef
Detailed Description
Describes a Structural Analytical Model Member Point Load.
Since
Archicad 25
Remarks
A Point Load element can be created with the aid of ACAPI_Element_Create and it can be removed via the ACAPI_Element_Delete function. Currently the ACAPI_Element_Change function is unavailable for Analytical Point Loads.
Member Data Documentation
◆ analyticalPointLoadSettings
 API_AnalyticalPointLoad_Settings API_AnalyticalPointLoadType::analyticalPointLoadSettings
◆ loadedMemberPartRef
 API_AnalyticalMemberPartRef API_AnalyticalPointLoadType::loadedMemberPartRef